let judgment = [
  {
    title:
      "生产资料私有制的社会主义改造完成以后,阶级斗争仍然是中国国内主要矛盾。() ",
    answer: "错误",
  },
  {
    title: "新民主主义革命实际上是为中国民族资本主义的发展创造条件的。() ",
    answer: "正确",
  },
  {
    title: "新解放区的土地改革是消灭地主阶级,也是消灭地主个人。() ",
    answer: "错误",
  },
  {
    title:
      "标志着我党胜利地完成了指导思想上的拨乱反正是中共十一届六中全会通过的《关于建国以来党的若干历史问题的决议》。() ",
    answer: "正确",
  },
  {
    title:
      "半殖民地半封建的社会性质决定了中国共产党领导的革命包括民主主义革命和社会主义革命两个阶段,这是两个性质相同的革命过程。() ",
    answer: "错误",
  },
  {
    title:
      "毛泽东在《关于正确处理人民内部矛盾的问题》中指出,社会主义社会存在敌我矛盾和人民内部矛盾两类性质根本不同的矛盾。() ",
    answer: "正确",
  },
  {
    title:
      "党的十八届四中全会强调,坚持依法治国首先要坚持司法独立和司法公正。() ",
    answer: "错误",
  },
  {
    title: "人民公社化运动最大的失误是片面追求公有化程度。() ",
    answer: "正确",
  },
  { title: "民主革命时期党的中心任务是进行武装斗争。() ", answer: "正确" },
  {
    title:
      "新中国宣布成立后,中国政府宣布愿意同世界上一切国家无条件建立外交关系。() ",
    answer: "错误",
  },
  {
    title:
      "新时期加强干部队伍建设的“四化”方针是:革命化、年轻化.知识化、现代化。() ",
    answer: "错误",
  },
  {
    title: "通过《关于经济体制改革的决定》的是中共十二届二中全会。() ",
    answer: "错误",
  },
  {
    title:
      "第二次国共合作没有一个为国共两党所共同承认和正式公布的政治纲领。() ",
    answer: "正确",
  },
  {
    title:
      "“大跃进”运动是党在探索建设社会主义道路过程中的一次严重挫折,对在经济文化落后的大国建设社会主义的长期性、艰巨性估计不足。() ",
    answer: "正确",
  },
  {
    title: "实现“十二五”时期经济社会发展目标的根本保证是必须转变发展方式。() ",
    answer: "错误",
  },
  {
    title:
      "我们党的最大政治优势是有马克思列宁主义、毛泽东思想、邓小平理论、“三个代表”重要思想、科学发展观和习近平新时代中国特色社会主义思想作为党的理论基础。() ",
    answer: "错误",
  },
  {
    title:
      "我国的新民主主义革命发生在十月革命以后,属于世界无产阶级革命的范畴。() ",
    answer: "正确",
  },
  {
    title: "毛泽东提出要把正确处理人民内部矛盾作为国家政治生活的主题。() ",
    answer: "正确",
  },
  {
    title: "过渡时期社会主义建设总路线的主体是实现国家的工业化。() ",
    answer: "正确",
  },
  {
    title: "农业合作化运动中,采取了依靠贫下中农、团结中农、限制富农的政策。() ",
    answer: "错误",
  },
  {
    title: "从组织上确立了中国共产党对军队的领导制度是在“三湾改编”以后。( ) ",
    answer: "正确",
  },
  { title: "抗日战争时期的统一战线,其政治基础是共同抗日。() ", answer: "正确" },
  {
    title:
      "按照十九届五中全会确定的2035年远景目标,届时我国人均国内主产总值达到上中等发达国家水平。() ",
    answer: "错误",
  },
  { title: '延安整风运动的方针是“惩前毖后,治病救人"。() ', answer: "正确" },
  {
    title:
      "反右派斗争严重扩大化的主要原因,是由于中国共产党对社会主义时期阶级斗争的特点和规律缺乏全面的深刻的正确认识。() ",
    answer: "正确",
  },
  {
    title:
      "工人阶级和农民阶级的矛盾属于人民内部矛盾,而工人阶级与民族资产阶级的矛盾则属于敌我矛盾。() ",
    answer: "错误",
  },
  {
    title:
      "与所有其他社会的基本矛盾一样,社会主义社会的基本矛盾是具有对抗性的。() ",
    answer: "错误",
  },
  {
    title:
      "被称为中国共产党进入21世纪的政治宣言的是江泽民同志在庆祝中国共产党成立80周年大会上的讲话。() ",
    answer: "正确",
  },
  {
    title:
      "从根本理论上否定了“两个凡是”的错误、揭开了真理标准讨论序幕的是1978年5月11日《光明日报》发表的题为“实践检验真理:马克思主义的一条基本原则”。() ",
    answer: "错误",
  },
  {
    title:
      "1956年9月,党的八大召开,标志着党对中国社会主义建设道路的探索的开始。() ",
    answer: "错误",
  },
  {
    title:
      "党的十八大报告中提出,建设中国特色社会主义,总依据是社会主义初级阶段,总布局是“五位一体”,总任务是实现社会主义现代化和中华民族伟大复兴。() ",
    answer: "正确",
  },
  {
    title: "“十四五”时期经济社会发展的主题是推动高质量发展。() ",
    answer: "正确",
  },
  {
    title:
      "党的十九大报告指出,中国特色社会主义进入新时代,我国社会主要矛盾已经转化为人民日益增长的物质文化需要和不平衡不充分的发展之间的矛盾。() ",
    answer: "错误",
  },
  {
    title:
      "1949年10月1日,毛泽东在天安门城楼上宣布中华人民共和国成立,当天,全国所有各大中城市都举行了热烈的庆祝活动。() ",
    answer: "错误",
  },
  { title: "辛亥革命是完全失败的一次近代革命。() ", answer: "错误" },
  {
    title:
      "新中国成立从根本上结束了100多年来中华民族受帝国主义侵略压迫的历史。() ",
    answer: "正确",
  },
  {
    title: "坚持科学发展观,就不能强调以经济建设为中心,强调以经济建发展。() ",
    answer: "错误",
  },
  {
    title: "毛泽东提出了社会主义可以分为不发达和比较发达的两个阶段的思想。() ",
    answer: "正确",
  },
  {
    title:
      "毛泽东发动“文化大革命”的出发点是防止资本主义复辟、维护党的纯洁性。() ",
    answer: "正确",
  },
  {
    title:
      "完成全面建设小康社会和实现现代化的历史性任务,重点和难点都在农村。() ",
    answer: "正确",
  },
  {
    title: "无产阶级是一个先进的阶级,所以无产阶级内部每一个人当然都很先进。() ",
    answer: "错误",
  },
  {
    title: "1928年6月在莫斯科举行了中国共产党第五次全国代表大会。() ",
    answer: "错误",
  },
  {
    title:
      "我党继延安整风运动之后的又一次思想解放运动是粉碎“四人帮”后开展的真理标准问题的大讨论。() ",
    answer: "正确",
  },
  {
    title:
      "1954年制定的《中华人民共和国宪法》体现了人民民主原则和社会主义原则。() ",
    answer: "正确",
  },
  { title: "社会主义社会的矛盾不表现为对抗性质。() ", answer: "正确" },
  {
    title: "对民族资本主义工商业必须采取没收、限制改造的政策。() ",
    answer: "错误",
  },
  {
    title: "1935年1月召开的遵义会议是我党的历史上一个生死攸关的转折点。() ",
    answer: "正确",
  },
  {
    title:
      "“三个代表”重要思想的提出,是我们党在自身建设问题上的一个重大理论突破。() ",
    answer: "正确",
  },
  {
    title: "1954年,中共七届四中全会通过了《关于增强党的团结的决议》。() ",
    answer: "正确",
  },
  { title: "我国目前农业生产的主要经营方式是集约化经营。() ", answer: "错误" },
  {
    title:
      "全面建设小康社会的目标是在优化结构和提高效益的基础上,国内生产总值到2020年力争比2000年翻一番。() ",
    answer: "错误",
  },
  {
    title:
      "党的十大与党的九大一样,在思想路线、政治路线和组织路线上都是错误的。() ",
    answer: "正确",
  },
  {
    title:
      "新文化运动开始的标志是1915年陈独秀担任主编的《新青年》(原名《青年杂志》)正式出版。() ",
    answer: "正确",
  },
  {
    title:
      "按照党的十九大要求,到新中国成立一百年时,基本实现现代化,把我国建成社会主义现代化国家。() ",
    answer: "正确",
  },
  {
    title: "“一国两制”构想的提出,先是从解决台湾问题开始的。() ",
    answer: "正确",
  },
  {
    title: "第一届全国人民代表大会选举的人大常委会委员长是董必武。() ",
    answer: "错误",
  },
  {
    title: "孙中山领导的中国同盟会领导和指挥了1911年10月爆发的武昌起义。() ",
    answer: "错误",
  },
  {
    title: "新文化运动已经超出了反帝反封建的资产阶级民主主义的范畴。() ",
    answer: "错误",
  },
  {
    title: "经济体制改革迅速地在全国范围内全面展开是在中共十三大以后。() ",
    answer: "错误",
  },
  { title: "我国剥削制度被消灭的标志是土地改革的完成。() ", answer: "错误" },
  {
    title:
      "人民军队区别于其他一切军队的基本标志就是,不仅是战斗队,而且也是工作队和生产队。() ",
    answer: "正确",
  },
  {
    title:
      "邓小平在中共十二大致开幕词时,第一次提出了“建设有中国特色的社会主义”的崭新命题。() ",
    answer: "正确",
  },
  {
    title:
      "毛泽东发动“文化大革命”的这些“左”倾错误论点,必须把它们同毛泽东思想完全区别开来。() ",
    answer: "正确",
  },
  {
    title:
      "我们党在历史上出现过的右和“左”的错误,其根本原因即在于思想路线的错误。() ",
    answer: "正确",
  },
  { title: "党内的主观主义有教条主义和冒险主义两种。() ", answer: "错误" },
  {
    title:
      "代表中国最广大人民的根本利益是“三个代表”的基础,而代表中国先进生产力的发展要求则是“三个代表”的归宿。() ",
    answer: "错误",
  },
  {
    title: "党的十八届四中全会提出,法律的生命力和法律的权威在于实施。() ",
    answer: "正确",
  },
  {
    title:
      "决定当代中国命运的关键扶择是发展中国特色社会主义,实现中华民族伟大复兴的必由之路就是改革开放。 ",
    answer: "正确",
  },
  { title: "社会主义市场经济本质上是法治经济。() ", answer: "正确" },
  {
    title:
      "“文化大革命”是由林彪、“四人帮”一伙发动和领导的,他们一“文”一“武”左右开弓,为这场史无前例的运动制造了排山倒海之势。() ",
    answer: "错误",
  },
  {
    title:
      "20世纪60年代初,毛泽东在读完苏联《政治经济学教科书》后指出,在我们的国家完成社会主义建设是一个艰巨的任务,需要100年以上的时间。() ",
    answer: "正确",
  },
  {
    title: "1949年的《共同纲领》起了中华人民共和国临时宪法的作用。() ",
    answer: "正确",
  },
  {
    title:
      "党的十八届四中全会审议通过了《中共中央关于全面推进依法治国若干重大问题的决定》,指出全面推进依法治国的总目标是建设中国特色社会主义法治体系,建设社会主义法治国家。() ",
    answer: "正确",
  },
  {
    title:
      "衡量政绩的最终标准是人民拥护不拥护、赞成不赞成、高兴不高兴、答应不答应。() ",
    answer: "正确",
  },
  {
    title: "党的十八届四中全会强调,社会主义法治最根本的保证是党的领导。() ",
    answer: "正确",
  },
  {
    title:
      "党的十八大是在我国进入全面建设小康社会决定性阶段召开的一次重要会议。() ",
    answer: "错误",
  },
  {
    title:
      "改革开放40年来,我们始终坚持以经济建设为中心,不断解放和发展社会生产力,我国国内生产总值年均实际增长超过10%。() ",
    answer: "正确",
  },
  {
    title:
      "随着我国改革开放和现代化建设的快速发展,我国作为世界最大发展中国家的国际地位已经发生变化。() ",
    answer: "错误",
  },
  {
    title:
      "土地革命期间,中国社会的主要矛盾是人民大众同国民党反动派的阶级矛盾。() ",
    answer: "错误",
  },
  {
    title: "巴黎和会规定,德国应将在中国山东获得的一切特权转让给日本。() ",
    answer: "正确",
  },
  {
    title:
      "规定党中央不设主席只设总书记,由总书记负责召集中央政洽局会议、政治局常委会和主持中央书记处工作的,是党的十二大通过的新党章。() ",
    answer: "正确",
  },
  {
    title:
      "刘少奇被选举为中华人民共和国主席是1954年第一届全国人大一次会议。() ",
    answer: "错误",
  },
  {
    title:
      "党的十八大报告深化了对中国特色社会主义的认识,首次将“中国特色社会主义制度”写入党的全国代表大会报告中。() ",
    answer: "正确",
  },
  {
    title:
      "官僚资产阶级是中国民主革命的对象,在任何时候都不能与他们组成统一战线。() ",
    answer: "错误",
  },
  {
    title: "第一次明确提出了反帝反封建的民主革命纲领的是中共三大。() ",
    answer: "错误",
  },
  {
    title: "社会主义民主与资本主义民主的根本区别在于是否实现人民当家作主。() ",
    answer: "正确",
  },
  {
    title:
      "社会主义政治文明区别于资本主义政治文明的本质特征是:坚持党的领导、人民当家作主和依法治国的有机统一。() ",
    answer: "正确",
  },
  {
    title: "新中国成立初期的“五反”运动主要在国营企业和国家机关中进行。() ",
    answer: "错误",
  },
  { title: "党的三大优良作风是在中共八大上提出的。() ", answer: "错误" },
  {
    title: "经济体制改革全面展开是在中共十一届三中全会后。() ",
    answer: "错误",
  },
  {
    title:
      "因为社会主义改造在1956年才完成, 1954年制定的宪法当然不能说是社会主义类型的宪法。() ",
    answer: "错误",
  },
  {
    title:
      "党的第一次代表大会通过了党的纲领,正式确立党的名称为“中国共产党”。() ",
    answer: "正确",
  },
  {
    title:
      "1957年4月27日,中共中央正式发出《关于整风运动的指示》,其主题是正确处理人民内部矛盾。() ",
    answer: "正确",
  },
  {
    title:
      "党的十八大指出,只要我们胸怀理想、坚定信念,不动摇、不懈怠、不折腾,顽强奋斗、艰苦奋斗、不懈奋斗,就一定能在建党100年时全面建成小康社会,就一定能在新中国成立150年时建成富强民主文明和谐的社会主义现代化国家。() ",
    answer: "错误",
  },
  {
    title:
      "1977年召开的中共十一大基本上否定了“文化大革命”的错误理论和政策。() ",
    answer: "错误",
  },
  {
    title:
      "“欲悲闻鬼叫,我哭豺狼笑。洒泪祭雄杰,扬眉剑出鞘。” “文化大革命”后期,这首有代表性的诗矛头直指林彪反党集团。() ",
    answer: "错误",
  },
  {
    title: "在当代中国,坚持中国特色社会主义道路,就是真正坚持社会主义。() ",
    answer: "正确",
  },
  { title: "“文化大革命”起止时间是1966年5月到1976年10月。() ", answer: "正确" },
  {
    title: "“三面红旗”指的是“大跃进”、人民公社和“文化大革命”。() ",
    answer: "错误",
  },
  { title: "王明犯的错误一直是“左”倾机会主义错误。() ", answer: "错误" },
  {
    title:
      "全面进行经济体制改革的的纲领性文件是中共十二届三中全会通过的《关于经济体制改革的决定》。() ",
    answer: "正确",
  },
  {
    title: "坚持以人为本,就是要把解决人民群众的所有问题放在首位。() ",
    answer: "错误",
  },
  {
    title: "“九一三”事件在客观上宣告“文化大革命”的理论和实践的破产。() ",
    answer: "正确",
  },
  {
    title:
      "对社会主义建设探索过程中,毛泽东认为,在社会主义条件下发展商品生产不会导致资本主义。() ",
    answer: "正确",
  },
  {
    title:
      "1984年10月中共十二届三中全会后,农村改革进入第二步,重点调整农村产业结构,大力发展商品经济。() ",
    answer: "错误",
  },
  {
    title: "确定党的名称为“中国共产党”是在党正式成立之前。() ",
    answer: "错误",
  },
  {
    title: "第一次“左”倾错误是在瞿秋白为中央主要领导的时候发生的。() ",
    answer: "正确",
  },
  {
    title:
      "经济是基础,经济关系是划分阶级的主要标准,所以一个人的政治先进与否与他拥有的财产有直接的关系。() ",
    answer: "错误",
  },
  {
    title:
      "辛亥革命第一次推翻了封建主义,恢复了国家的主权,使中国走上了独立、民主、富强之路。() ",
    answer: "错误",
  },
  {
    title:
      "第一次国内革命战争是中国人民在中国共产党和中国国民党合作领导下进行的反帝反封建的革命斗争。() ",
    answer: "正确",
  },
  {
    title:
      "1957年的整风运动和1942年的延安整风运动相比较,在内容上的主要不同点是反对官僚主义。() ",
    answer: "正确",
  },
  {
    title: "农村人民公社化运动违背了生产关系要与生产力相适应的关系。() ",
    answer: "正确",
  },
  {
    title: "社会主义社会的人民内部矛盾不包括民族资产阶级内部的矛盾。() ",
    answer: "错误",
  },
  {
    title:
      "1950年5月1日颁行的《中华人民共和国婚姻法》是新中国制定的第一部法律。() ",
    answer: "正确",
  },
  {
    title:
      "党的十八届三中全会指出,全面深化改革,必须立足于我国长期处于社会主义初级阶段这个最大实际,解决我国所有问题的关键是创新。() ",
    answer: "错误",
  },
  {
    title:
      "我国社会主义初级阶段的起始时间是1956年生产资料所有制的社会主义改造基本完成。() ",
    answer: "正确",
  },
  {
    title:
      "1982年到1984年,中央连续发出三个“一号文件”,不断推出稳定和完善家庭联产承包责任制的措施。() ",
    answer: "正确",
  },
  {
    title:
      "轰轰烈烈的辛亥革命最终归于失败的根本原因是没有一个坚强有力的革命政党。() ",
    answer: "正确",
  },
  { title: "1942年延安整风最主要的任务是反对机会主义。() ", answer: "错误" },
  {
    title:
      "经过新中国成立以来特别是改革开放以来的不懈努力,我国取得了举世瞩目的发展成就,从生产力到生产关系、从经济基础到上层建筑都发生了意义深远的本质变化。() ",
    answer: "错误",
  },
  {
    title:
      "1977年到1978年经济建设中的新冒进,加剧了长期以来形成的国民经济比例失调。() ",
    answer: "正确",
  },
  { title: "毛泽东《论十大关系》主要讨论的是经济问题。() ", answer: "正确" },
  {
    title:
      "2015年11月7日,中共中央总书记、国家主席习近平同台湾国民党主席马英九在新加坡会面,就进一步推进两岸关系和平发展交换意见。这是1949年以来两党领导人的首次会面。() ",
    answer: "正确",
  },
  {
    title:
      "确立了邓小平建设有中国特色社会主义理论在全党的指导地位是在中共十五大上。() ",
    answer: "错误",
  },
  {
    title:
      "社会主义革命的根本任务,是消灭资本主义私有制,消灭资产阶级,建立社会主义公有制。() ",
    answer: "正确",
  },
  {
    title: "坚持和发展中国特色社会主义的必由之路是共产党领导。() ",
    answer: "错误",
  },
  {
    title: "“枪杆子里面出政权”是毛泽东在遵义会议上第一次提出的。() ",
    answer: "错误",
  },
  {
    title:
      "社会主义三大改造是指新中国成立初期,中国共产党在全国范围内组织的对于农业、手工业和资本主义工商业进行的社会主义改造。其中,对于资本主义工商业的社会主义改造是三大改造的重点。() ",
    answer: "正确",
  },
  {
    title:
      "“四马分肥”是社会主义改造中对资本主义企业的赎买方式,指企业利润按国家征收的所得税金、企业公积金、职工福利奖金和资方的股息红利四部分。() ",
    answer: "正确",
  },
  {
    title: "我国社会主义制度初步建立起来是在农业合作化基本完成以后。() ",
    answer: "错误",
  },
  {
    title: "当前我国最大的实际就是我国还处于并将长期处于社会主义初级阶段。() ",
    answer: "正确",
  },
  {
    title:
      "全面深化改革总目标是完善和发展中国社会主义市场经济体制、推进国家治理体系和治理能力现代化。() ",
    answer: "错误",
  },
  {
    title:
      "改革开放以来,工人阶级队伍已经发生、并且继续发生着巨大而深刻的变化,但这些变化没有改变工人阶级体力劳动的地位。() ",
    answer: "错误",
  },
  {
    title:
      "按照党的十九届五中全会要求,到2035年时我国的关键核心技术实现重大突破,进入创新型国家前列。() ",
    answer: "正确",
  },
  {
    title:
      "对执政党的特点,毛泽东始终把坚持实事求是和密切联系群众作为党风建设的重点。() ",
    answer: "正确",
  },
  {
    title:
      "人类社会的一般规律是:资产阶级民主革命由资产阶级及其政党领导,无产阶级革命由无产阶级及其政党领导。中国的新民主主义革命也不能违背这一规律。() ",
    answer: "错误",
  },
  {
    title:
      "“文化大革命”是一场浩劫,使我国失去宝贵的历史机遇,“文化大革命”十年期间工农业总产值指数出现了负增长。() ",
    answer: "错误",
  },
  {
    title:
      "确立了全面建设小康社会的战略目标,制定了全面建设小康社会的行动纲领的是中共十六大。() ",
    answer: "正确",
  },
  {
    title:
      "江泽民同志在中共十五大报告中指出,一个世纪以来中国产生了三位站在时代前列的伟大人物,他们是孙中山、毛泽东和邓小平。() ",
    answer: "正确",
  },
  {
    title:
      "持马克思主义基本原理同中国具体实际相结合,是对待马克思主义唯一正确和科学的态度。() ",
    answer: "正确",
  },
];
lead();